#+TITLE: wheel

* wheel
#+BEGIN_SRC emacs-lisp :results output
(setq slice-formats (list
      "{'fillStyle' : '#ee1c24', 'text' : '%s'},"
      "{'fillStyle' : '#3cb878', 'text' : '%s'},"
      "{'fillStyle' : '#f6989d', 'text' : '%s'},"
      "{'fillStyle' : '#00aef0', 'text' : '%s'},"
      "{'fillStyle' : '#f26522', 'text' : '%s'},"
      "{'fillStyle' : '#000000', 'text' : '%s'},"
      "{'fillStyle' : '#e70697', 'text' : '%s'},"
      "{'fillStyle' : '#fff200', 'text' : '%s'},"
      "{'fillStyle' : '#f6989d', 'text' : '%s'},"
      "{'fillStyle' : '#ee1c24', 'text' : '%s'},"
      "{'fillStyle' : '#3cb878', 'text' : '%s'},"
      "{'fillStyle' : '#f26522', 'text' : '%s'},"
      "{'fillStyle' : '#a186be', 'text' : '%s'},"
      "{'fillStyle' : '#fff200', 'text' : '%s'},"
      "{'fillStyle' : '#00aef0', 'text' : '%s'},"
      "{'fillStyle' : '#ee1c24', 'text' : '%s'},"
      "{'fillStyle' : '#f6989d', 'text' : '%s'},"
      "{'fillStyle' : '#f26522', 'text' : '%s'},"
      "{'fillStyle' : '#3cb878', 'text' : '%s'},"
      "{'fillStyle' : '#000000', 'text' : '%s'},"
      "{'fillStyle' : '#a186be', 'text' : '%s'},"
      "{'fillStyle' : '#fff200', 'text' : '%s'},"
      "{'fillStyle' : '#00aef0', 'text' : '%s'},"
      "{'fillStyle' : '#ffffff', 'text' : '%s'}"
      ))


(dotimes (i (length slice-formats))
  (print (format (nth i slice-formats)
                 (nth i movies))))
#+END_SRC

#+RESULTS:
#+begin_example
"{'fillStyle' : '#ee1c24', 'text' : 'Midnight Cowboy'},"
"{'fillStyle' : '#3cb878', 'text' : 'Serpico'},"
"{'fillStyle' : '#f6989d', 'text' : 'Born into This'},"
"{'fillStyle' : '#00aef0', 'text' : 'I Love You, Alice B. Toklas'},"
"{'fillStyle' : '#f26522', 'text' : 'Raiders of the Lost Ark'},"
"{'fillStyle' : '#000000', 'text' : 'Rocky'},"
"{'fillStyle' : '#e70697', 'text' : 'Princess Mononoke'},"
"{'fillStyle' : '#fff200', 'text' : 'Andromeda Strain'},"
"{'fillStyle' : '#f6989d', 'text' : 'Mr. Smith Goes to Washington'},"
"{'fillStyle' : '#ee1c24', 'text' : 'The Aviator'},"
"{'fillStyle' : '#3cb878', 'text' : 'Easy A'},"
"{'fillStyle' : '#f26522', 'text' : 'Bridge of Spies'},"
"{'fillStyle' : '#a186be', 'text' : '2001: A Space Odyssey'},"
"{'fillStyle' : '#fff200', 'text' : 'The Shining'},"
"{'fillStyle' : '#00aef0', 'text' : 'Caddyshack'},"
"{'fillStyle' : '#ee1c24', 'text' : 'Body Heat'},"
"{'fillStyle' : '#f6989d', 'text' : 'Inland Empire'},"
"{'fillStyle' : '#f26522', 'text' : '*M*A*S*H'},"
"{'fillStyle' : '#3cb878', 'text' : 'Bad Day at Black Rock'},"
"{'fillStyle' : '#000000', 'text' : 'Broadcast News'},"
"{'fillStyle' : '#a186be', 'text' : 'One Flew Over the Cuckoo's Nest'},"
"{'fillStyle' : '#fff200', 'text' : 'Memento'},"
"{'fillStyle' : '#00aef0', 'text' : 'Labyrinth'},"
"{'fillStyle' : '#ffffff', 'text' : 'Rear Window'}"
#+end_example
* The list for trying
#+BEGIN_SRC emacs-lisp
(setq movies '("Midnight Cowboy"
               "Serpico"
               "Born into This"
               "I Love You, Alice B. Toklas"
               "Raiders of the Lost Ark"
               "Rocky"
               "Princess Mononoke"
               "Andromeda Strain"
               "Mr. Smith Goes to Washington"
               "The Aviator"
               "Easy A"
               "Bridge of Spies"
               "2001: A Space Odyssey"
               "The Shining"
               "Caddyshack"
               "Body Heat"
               "Inland Empire"
               "*M*A*S*H"
               "Bad Day at Black Rock"
               "Broadcast News"
               "One Flew Over the Cuckoo's Nest"
               "Memento"
               "Labyrinth"
               "Rear Window"))
#+END_SRC
#+RESULTS:
| Midnight Cowboy | Serpico | Born into This | I Love You, Alice B. Toklas | Raiders of the Lost Ark | Rocky | Princess Mononoke | Andromeda Strain | Mr. Smith Goes to Washington | The Aviator | Easy A | Bridge of Spies | 2001: A Space Odyssey | The Shining | Caddyshack | Body Heat | Inland Empire | *M*A*S*H | Bad Day at Black Rock | Broadcast News | One Flew Over the Cuckoo's Nest | Memento | Labyrinth | Rear Window |
* Working the list
#+BEGIN_SRC emacs-lisp :results output
(dolist (x xx-result)
  (print x)
  )
#+END_SRC
#+RESULTS:
** more if i need them
"A Streetcar Named Desire"
"Godfather 2"
"** Lynch films list"
"|   |  18 | THE GENERAL                        | 1927 |         |"
"Pirates of the Carribean"
"*Straw Dogs"
"Upstream Color (followup to Primer)                           :netflix:"
"The Quills"
"*The Verdict"
"Under the Skin"
"[[http://www.techhive.com/article/218797/netflix-power-tools.html][10 tricks and tips to get the most from your Netflix subscription]]"
"Being There"
"*Lone Star"
"|   |  52 | TAXI DRIVER                        | 1976 |         |"
"|   |  24 | E.T. THE EXTRA-TERRESTRIAL         | 1982 |         |"
"The General"
"*Shaun of the Dead"
"Saving Private Ryan"
"** In theaters"
"Chinatown"
"Lust Caution"
"Upstream Color (followup to Primer)                           :netflix:"
"|   |  93 | THE FRENCH CONNECTION              | 1971 | Wayland |"
"Raging Bull"
"Leaving Las Vegas"
"The Aviator                                                      :nina:"
"The girl with the Dragon Tattoo (Daniel Craig version) *"
"*Watched Atonement (2007) with Ninan"
"The Godfather"
"Smilla's Sense of Snow"
"** [[http://whatculture.com/film/10-outrageously-sexy-moments-in-pg-movies][10 Outrageously Sexy Moments In PG Movies]]"
"Matrix *"
"Timecrimes"
"*Alien"
"Bond movies"
"|   |  91 | SOPHIE'S CHOICE                    | 1982 | Netflix |"
"Becket"
"[[http://whatsonprimenow.blogspot.com/][What's On PRIME Now?]]"
"Thirteen Days"
"the Maltese Falcon"
"|   |  63 | CABARET                            | 1972 |         |"
"Blue Bloods"
"Under the Skin"
"|   |  42 | BONNIE AND CLYDE                   | 1967 |         |"
"No Country for Old Men                                        :netflix:"
"Thunderbolt and Lightfoot"
"American Graffiti"
"Straw Dogs"
"Leaving Las Vegas"
"Hot Tub Time Machine (IRR rec)"
"|   |  85 | A NIGHT AT THE OPERA               | 1935 |         |"
"Wild Things"
"Striptease"
"Interstellar"
"Suspicion"
"One Million Years B.C."
"|   |  27 | HIGH NOON                          | 1952 | Netflix |"
"Matrix"
"High Noon                                                       :netflix:"
"Homeland (in my iTunes)"
"The Big Red One"
"Grindhouse"
"Who's Afraid of Virginia Woolf?"
"*Caddyshack"
"** [[http://whatculture.com/film/10-outrageously-sexy-moments-in-pg-movies][10 Outrageously Sexy Moments In PG Movies]]"
"AntiTRUST"
"Cashback"
"Blue is the Warmest Color"
"Spring Breakers"
